src/Documents/КассовыйЧек/КассовыйЧек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КассовыйЧек</name>
  <basedOn>Document.ПлатежноеПоручение</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипОперацииЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПлатежноеПоручение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйАттрибут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУдаленное</name>
    <type>
      <types>DocumentRef.ПлатежноеПоручение</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКвитанции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.ВидОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/OnlineCashboxСервер/Module.bsl
/////////////////////////////////////////////////////////////////////////////////////
// design by GRish!                                                    01/04/2019
//  
// методы общие для нескольких объектов
//  
//

/////////////////////////////////////////////////////////////////////////////////////
//  Работа с CSV файлом
//

procedure SetIdColumsCSV(list) export
	
	Константы.ПоляФайлаCSV.Set(new ValueStorage(list));
	
endprocedure

function  GetIdColumsCSV() export
	
	storage = Константы.ПоляФайлаCSV.Get();
	if storage<>undefined then
		list = storage.Get();
		if list<>undefined then
			return list;
		endif;
	endif;
	
	return new array;	
	
endfunction

/////////////////////////////////////////////////////////////////////////////////////
//  Движения регистра накопления
//

Процедура ОбработкаПроведенияДокументов(Источник, Отказ, РежимПроведения) Экспорт
	
	if TypeOf(Источник) = type("ДокументОбъект.Договор") then
		moving = Источник.RegisterRecords.ВзаиморасчетыПоДелам;    
		moving.Clear();
		
		tbl = Источник.Квитанции.Unload();
		tbl.GroupBy("","Сумма,СуммаНДС");
		for each row in tbl do
			newRow = moving.Add();
			
			FillPropertyValues(newRow, row);
			
			newRow.Period = Источник.Date;
			newRow.Договор = Источник.Ref;
			newRow.RecordType = AccumulationRecordType.Receipt;
		endDo;
		moving.Write = true;
		
	elsif TypeOf(Источник) = type("ДокументОбъект.ПлатежноеПоручение") then
		moving = Источник.RegisterRecords.ВзаиморасчетыПоДелам;    
		moving.Clear();
		//(+) Сводные платежки от ПАО Сбербанк
		if ValueIsFilled(Источник.Договор) and not Источник.СводныйПлатеж then
			newRow = moving.Add();
			
			newRow.Period = Источник.Date;
			
			newRow.Договор    = Источник.Договор;
			newRow.Сумма      = Источник.Сумма;
			newRow.СуммаНДС   = Источник.СуммаНДС;
			
			newRow.RecordType = AccumulationRecordType.Expense;
		endif;
		
		moving.Write = true;
	endif;	
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
//
//

//получить кассовый чес создаанный для платежки
//
function GetCashVoucherForPP(Платеж) export
	return Documents.КассовыйЧек.FindByAttribute("Основание", Платеж);
endfunction
